{
    "header": {
        "button": {
            "back": "Назад",
            "home": "Към началото"
        }
    },
    "banner": {
        "paragraph": "Готови ли сте да строите автомати?",
        "button": "Нека започнем!"
    },
    "components": {
        "tutorial_video": "Видео урок"
    },
    "editor_tour": {
        "step1": "Това е страницата за редакция. Тук ще строите автомати. Нека разгледаме инструментите, които ще ползвате.",
        "step2": "С мишката можете да изберете едно или повече състояния и да ги местите където искате.",
        "step3": "С ръката можете да местите екрана.",
        "step4": "С инструмента за състояния можете да създавате състояния.",
        "step5": "С инструмента за преходи можете да създавате преходи между състоянията.",
        "step6": "С инструмента за коментари можете да добавяте лични коментари",
        "step7": "В лабораторията за тестване можете да въведете и изпробвате всякакви думи във Вашият автомат.",
        "step8": "\"За Вашият Автомат\" показва подробна информация за Вашия автомат.",
        "step9": "От опциите на файла можете да промените обозначителите на състоянията, знаците и темата на проекта.",
        "step10": "От шаблоните можете да създадете шаблон от състояния за в бъдеще. Там също имате достъп към запазените Ви шаблони.",
        "step11": "От модулите можете да създадете и отворите нов модул или да разгледате и променяте отворен модул."
    },
    "fsa_tour": {
        "step1": "Добре дошли в примера за Краен Автомат. В този пример, ще Ви покажем как да създадете Краен Автомат, който приема всички думи които започват с буква a, завършват с буква b и са написани на латиница.",
        "step2": "За да започнем, изберете инструмента за състояния и кликнете върху екрана за да създадете 3 състояния.",
        "step3": "Когато кликнете върху състояние с дясното копче, отваряте меню. От там, можете да изберете кое състояние е начално, и кои състояния са крайни. Нека направим q0 началното състояние и превключим q2 като крайно.",
        "step4": "Сега трябва да създадем преходи между нашите състояния. Изберете инструмента за преходи, натиснете върху q0 и влачете до q1 за да създадете преход между състоянията. Automatarium ще Ви пита какви букви се приемат за прехода. Понеже изкаме да приемаме само стринговете които започват с a, въведете a (на латиница).",
        "step5": "След това, натиснете върху q1 за да създадете преход от q1 в себе си. Този преход ще приема всички латински букви от [a-z], защото искаме да приемем всички думи които завършват с a и завършват с b, без значение какво се намира между тях.",
        "step6": "Последно, създадете преход между q1 и q2 който приема буква b, за да потвърдим че приемаме само думи, които завършват с b.",
        "step7": "Успешно създадохме Крайният Автомат. Сега може да отидем в лабораторията, да въведем разни думи и да видим резултата."
    },
    "landing_tour": {
        "step1": "Добре дошли в Automatarium!",
        "step2": "Automatarium е сайт който помага за изучаване на изучаване на езици и автомати. Когато сте готови, натиснете тук.",
        "step3": "За да научите повече за сайта, разгледайте нашите видео уроци.",
        "step4": "Тук е демонстрация на лабораторията.",
        "step5": "Натиснете стрелките, за да видите как машината горе реагира на въведената дума.",
        "step6": "Също така, можете да натиснете дясното копче за да отидете директно до края на пробата.",
        "step7": "Когато започнете да създавате автомати, ще изглеждат по този начин в сайта."
    },
    "new_tour": {
        "step1": "Тук може да изберете какъв вид проект да създадете.",
        "step2": "Можете да създадете 3 различни вида автомат: Краен Автомат, Стеков Автомат или Машина на Тюринг.",
        "step3": "Тук можете да отворите и да разгледате предишни проекти.",
        "step4": "Също можете да импортирате автомати от Вашият компютър, от URL или от текст (файлове и текст може да създадете когато експортирате вашият автомат)"
    },
    "pda_tour": {
        "step1": "Добре дошли в примера за Стеков Автомат. В този пример, ще Ви покажем как да създадете Стеков Автомат който приема палиндроми, създадени от буквите {a, b, c}.",
        "step2": "За да започнем, изберете инструмента за състояния и кликнете върху екрана за да създадете 2 състояния. Натиснете с дясно копче върху q0 и го направете началното състояние, и след това върху q1 за да го превключите на крайно състояние.",
        "step3": "Сега ще създадем 3 прехода от q0 към себе си. Изберете инструмента за преходи и кликнете върху q0. Automatarium ще Ви пита да определите прехода. \"λ (чете)\" е за буквата, която автомата приема, \"λ (вади)\" е за буквата, която трябва да се извади от стека, и \"λ (добавя)\" е за буквата, която ще се добави върху стека след прехода. За нашият палиндромен автомат, всеки преход ще чете малка буква и ще добавя голяма буква към стека (чете a, добавя A; чете b, добавя B; чете c, добавя C). Тези преходи също за показани долу.",
        "step4": "След това, ще създадем 4 прехода между q0 и q1. 3 от тях ще вадят буква от прехода, а 4-ият преход оставяме празен. Чрез тези преходи, отбелязваме средата на палиндрома.",
        "step5": "Последно, ще създадем 3 прехода от q1 към себе си. Тези преходи ще четат всяка малка буква от {a, b, c} и ще вадят съответстващата голяма буква {a, b, c}. Тези преходи също са показани долу.",
        "step6": "Автоматът е готов, време е да го изпробваме! Отворете лаборатотията и въведете палиндром от буквите {a, b, c}. Например, ако изпробвате думата \"abcba\", ще видите, че автоматът я приема като палиндром. Също така, когато натиснете , може да видите как стека се променя между всеки преход."
    },
    "tm_tour": {
        "step1": "Добре дошли в примера за Машина на Тюринг. В този пример, ще Ви покажем как да създадете Машина на Тюринг, която увеличава двоични числа.",
        "step2": "За да започнем, изберете инструмента за състояния и кликнете върху екрана за да създадете 3 състояния. Натиснете с дясно копче върху q0 и го направете началното състояние, и след това върху q2 за да го превключите на крайно състояние.",
        "step3": "Сега трябва да определим преходи. Изберете инструмента за преходи и кликнете върху q0. Automatarium ще Ви пита да определите прехода. Има 3 стойности за въвеждане. \"λ (чете)\" е за буквата която машината трябва да прочете на главата на лентата, \"λ (пише)\" е за буквата която ще замени сегашната глава на лентата, и \"R, L, S\" което определя къде ще се премести главата на лентата. L за вляво, R за вдясно и S за да остане на място.",
        "step4": "Понеже създаваме машина която увеличава двоично число, трябва да създадем преходи които да прочитат двоищно число. Кликнете върху q0 за да създадете 2 прехода от q0 към себе си. С тези преходи искаме да стигнем края на числото, така че единият преход ще чете 0, пише 0 и мести лентата вдясно(R), а другият ще чете 1, пише 1 и също ще мести лентата вдясно(R). Тези преходи също са показани долу.",
        "step5": "Когато стигнем края на числото, ще спрем да местим лентата вдясно. Създайте преход от q0 към q1 и оставете да чете и прочита λ, което представя празен символ в Automatarium. Ще изберем ляво(L) като посока на движение.",
        "step6": "Сега трябва да заменим всяко 1 от с 0 от края на числото докато стигнем 0 или началото. Спомнете си, че главата на лентата е на крайната цифра на числото. С инструмента за преходи, кликнете върху q1 за да създадете преход от q1 към себе си, който чете 1, пише 0 и мести лентата вляво.",
        "step7": "След като сме заменили всяко 1 което трябва с 0, трябва да заменим следващата 0 или празно пространство(ако сме отишли до началото) с 1. За тази цел, създайте два прехода между q1 и q2. Първият преход ще чете празен символ(λ), пише 1 и мести вдясно. Вторият преход ще чете 0, пише 1 и мести вдясно. Тези преходи също са показани долу.",
        "step8": "Машината на Тюринг която увеличава двоични числа е готова. За да я изпробвате, отворете лабораторията и въведете двоично число. Натиснете стрелките за да видите как лентата се променя след всяка стъпка. В даденият пример въвеждаме двоичното число 101, което се увеличава на 110.",
        "step9": "Automatarium също Ви предоставя с информация за Вашата машина. Можете да видите азбуката, таблицата за преходи и функцията на преходите. За да разгледате тази информация, натиснете информационният бутон, който се намира под бутона който отваря лабораторията."
    }
}